   - [#   1] COI find_max: 
--------------------------------------------------------------------------------
  22: def find_max(data):
  23:     '''Return the maximum element from a nonempty Python list.'''
  24:     biggest = data[0]
  25:     for val in data:
- 26:         if val > biggest:
+ 26:         if not (val > biggest):
  27:             biggest = val
  28:     return biggest
--------------------------------------------------------------------------------
[0.00744 s] killed by test_large_input (test_find_max.TestFindMax)

   - [#   2] ROR find_max: 
--------------------------------------------------------------------------------
  22: def find_max(data):
  23:     '''Return the maximum element from a nonempty Python list.'''
  24:     biggest = data[0]
  25:     for val in data:
- 26:         if val > biggest:
+ 26:         if val < biggest:
  27:             biggest = val
  28:     return biggest
--------------------------------------------------------------------------------
[0.00100 s] killed by test_large_input (test_find_max.TestFindMax)

   - [#   3] ROR find_max: 
--------------------------------------------------------------------------------
  22: def find_max(data):
  23:     '''Return the maximum element from a nonempty Python list.'''
  24:     biggest = data[0]
  25:     for val in data:
- 26:         if val > biggest:
+ 26:         if val >= biggest:
  27:             biggest = val
  28:     return biggest
--------------------------------------------------------------------------------
[0.00101 s] survived
