   - [#   1] AOR binary_search_iterative: 
--------------------------------------------------------------------------------
   1: def binary_search_iterative(data, target):
   2:     '''Return True if target is found in the given Python list.'''
   3:     low = 0
-  4:     high = len(data) - 1
+  4:     high = len(data) + 1
   5:     while low <= high:
   6:         mid = (low + high) // 2
   7:         if target == data[mid]:
   8:             return True
--------------------------------------------------------------------------------
[0.00401 s] killed by test_empty_list (test_binary_search_iterative.TestBinarySearchIterative)

   - [#   2] AOR binary_search_iterative: 
--------------------------------------------------------------------------------
   2:     '''Return True if target is found in the given Python list.'''
   3:     low = 0
   4:     high = len(data) - 1
   5:     while low <= high:
-  6:         mid = (low + high) // 2
+  6:         mid = (low - high) // 2
   7:         if target == data[mid]:
   8:             return True
   9:         elif target < data[mid]:
  10:             high = mid - 1
--------------------------------------------------------------------------------
[0.00000 s] killed by test_element_found (test_binary_search_iterative.TestBinarySearchIterative)

   - [#   4] AOR binary_search_iterative: 
--------------------------------------------------------------------------------
   2:     '''Return True if target is found in the given Python list.'''
   3:     low = 0
   4:     high = len(data) - 1
   5:     while low <= high:
-  6:         mid = (low + high) // 2
+  6:         mid = (low + high) * 2
   7:         if target == data[mid]:
   8:             return True
   9:         elif target < data[mid]:
  10:             high = mid - 1
--------------------------------------------------------------------------------
[0.00000 s] killed by test_element_found (test_binary_search_iterative.TestBinarySearchIterative)

   - [#   5] AOR binary_search_iterative: 
--------------------------------------------------------------------------------
   6:         mid = (low + high) // 2
   7:         if target == data[mid]:
   8:             return True
   9:         elif target < data[mid]:
- 10:             high = mid - 1
+ 10:             high = mid + 1
  11:         else:
  12:             low = mid + 1
  13:     return False
--------------------------------------------------------------------------------
[5.05492 s] timeout

   - [#   6] AOR binary_search_iterative: 
--------------------------------------------------------------------------------
   8:             return True
   9:         elif target < data[mid]:
  10:             high = mid - 1
  11:         else:
- 12:             low = mid + 1
+ 12:             low = mid - 1
  13:     return False
--------------------------------------------------------------------------------
[5.05854 s] timeout

   - [#   7] COI binary_search_iterative: 
--------------------------------------------------------------------------------
   1: def binary_search_iterative(data, target):
   2:     '''Return True if target is found in the given Python list.'''
   3:     low = 0
   4:     high = len(data) - 1
-  5:     while low <= high:
+  5:     while not (low <= high):
   6:         mid = (low + high) // 2
   7:         if target == data[mid]:
   8:             return True
   9:         elif target < data[mid]:
--------------------------------------------------------------------------------
[0.00000 s] killed by test_element_found (test_binary_search_iterative.TestBinarySearchIterative)

   - [#  10] ROR binary_search_iterative: 
--------------------------------------------------------------------------------
   1: def binary_search_iterative(data, target):
   2:     '''Return True if target is found in the given Python list.'''
   3:     low = 0
   4:     high = len(data) - 1
-  5:     while low <= high:
+  5:     while low >= high:
   6:         mid = (low + high) // 2
   7:         if target == data[mid]:
   8:             return True
   9:         elif target < data[mid]:
--------------------------------------------------------------------------------
[0.00000 s] killed by test_element_found (test_binary_search_iterative.TestBinarySearchIterative)

   - [#  11] ROR binary_search_iterative: 
--------------------------------------------------------------------------------
   1: def binary_search_iterative(data, target):
   2:     '''Return True if target is found in the given Python list.'''
   3:     low = 0
   4:     high = len(data) - 1
-  5:     while low <= high:
+  5:     while low < high:
   6:         mid = (low + high) // 2
   7:         if target == data[mid]:
   8:             return True
   9:         elif target < data[mid]:
--------------------------------------------------------------------------------
[0.00000 s] killed by test_single_element_list_found (test_binary_search_iterative.TestBinarySearchIterative)
