   - [#   1] AOR binary_sum: 
--------------------------------------------------------------------------------
  1: def binary_sum(S, start, stop):
  2:     '''Return the sum of the numbers in implicit slice S[start:stop].'''
  3:     if start >= stop:
  4:         return 0
- 5:     elif start == stop - 1:
+ 5:     elif start == stop + 1:
  6:         return S[start]
  7:     else:
  8:         mid = (start + stop) // 2
  9:         return binary_sum(S, start, mid) + binary_sum(S, mid, stop)
--------------------------------------------------------------------------------
[0.15822 s] killed by test_large_input (test_binary_sum.TestBinarySum)

   - [#   2] AOR binary_sum: 
--------------------------------------------------------------------------------
  4:         return 0
  5:     elif start == stop - 1:
  6:         return S[start]
  7:     else:
- 8:         mid = (start + stop) // 2
+ 8:         mid = (start - stop) // 2
  9:         return binary_sum(S, start, mid) + binary_sum(S, mid, stop)
--------------------------------------------------------------------------------
[0.15595 s] killed by test_large_input (test_binary_sum.TestBinarySum)

   - [#   3] AOR binary_sum: 
--------------------------------------------------------------------------------
  4:         return 0
  5:     elif start == stop - 1:
  6:         return S[start]
  7:     else:
- 8:         mid = (start + stop) // 2
+ 8:         mid = (start + stop) / 2
  9:         return binary_sum(S, start, mid) + binary_sum(S, mid, stop)
--------------------------------------------------------------------------------
[0.16474 s] killed by test_large_input (test_binary_sum.TestBinarySum)

   - [#   4] AOR binary_sum: 
--------------------------------------------------------------------------------
  4:         return 0
  5:     elif start == stop - 1:
  6:         return S[start]
  7:     else:
- 8:         mid = (start + stop) // 2
+ 8:         mid = (start + stop) * 2
  9:         return binary_sum(S, start, mid) + binary_sum(S, mid, stop)
--------------------------------------------------------------------------------
[0.15531 s] killed by test_large_input (test_binary_sum.TestBinarySum)

   - [#   5] AOR binary_sum: 
--------------------------------------------------------------------------------
  5:     elif start == stop - 1:
  6:         return S[start]
  7:     else:
  8:         mid = (start + stop) // 2
- 9:         return binary_sum(S, start, mid) + binary_sum(S, mid, stop)
+ 9:         return binary_sum(S, start, mid) - binary_sum(S, mid, stop)
--------------------------------------------------------------------------------
[0.00208 s] killed by test_large_input (test_binary_sum.TestBinarySum)

   - [#   6] COI binary_sum: 
--------------------------------------------------------------------------------
  1: def binary_sum(S, start, stop):
  2:     '''Return the sum of the numbers in implicit slice S[start:stop].'''
- 3:     if start >= stop:
+ 3:     if not (start >= stop):
  4:         return 0
  5:     elif start == stop - 1:
  6:         return S[start]
  7:     else:
--------------------------------------------------------------------------------
[0.15989 s] killed by test_empty_slice (test_binary_sum.TestBinarySum)

   - [#   7] COI binary_sum: 
--------------------------------------------------------------------------------
  1: def binary_sum(S, start, stop):
  2:     '''Return the sum of the numbers in implicit slice S[start:stop].'''
  3:     if start >= stop:
  4:         return 0
- 5:     elif start == stop - 1:
+ 5:     elif not (start == stop - 1):
  6:         return S[start]
  7:     else:
  8:         mid = (start + stop) // 2
  9:         return binary_sum(S, start, mid) + binary_sum(S, mid, stop)
--------------------------------------------------------------------------------
[0.00000 s] killed by test_large_input (test_binary_sum.TestBinarySum)

   - [#   8] ROR binary_sum: 
--------------------------------------------------------------------------------
  1: def binary_sum(S, start, stop):
  2:     '''Return the sum of the numbers in implicit slice S[start:stop].'''
- 3:     if start >= stop:
+ 3:     if start <= stop:
  4:         return 0
  5:     elif start == stop - 1:
  6:         return S[start]
  7:     else:
--------------------------------------------------------------------------------
[0.00000 s] killed by test_large_input (test_binary_sum.TestBinarySum)

   - [#   9] ROR binary_sum: 
--------------------------------------------------------------------------------
  1: def binary_sum(S, start, stop):
  2:     '''Return the sum of the numbers in implicit slice S[start:stop].'''
- 3:     if start >= stop:
+ 3:     if start > stop:
  4:         return 0
  5:     elif start == stop - 1:
  6:         return S[start]
  7:     else:
--------------------------------------------------------------------------------
[0.15134 s] killed by test_empty_slice (test_binary_sum.TestBinarySum)

   - [#  10] ROR binary_sum: 
--------------------------------------------------------------------------------
  1: def binary_sum(S, start, stop):
  2:     '''Return the sum of the numbers in implicit slice S[start:stop].'''
  3:     if start >= stop:
  4:         return 0
- 5:     elif start == stop - 1:
+ 5:     elif start != stop - 1:
  6:         return S[start]
  7:     else:
  8:         mid = (start + stop) // 2
  9:         return binary_sum(S, start, mid) + binary_sum(S, mid, stop)
--------------------------------------------------------------------------------
[0.00000 s] killed by test_large_input (test_binary_sum.TestBinarySum)
