   - [#   1] ASR disk_usage: 
--------------------------------------------------------------------------------
   5:     total = os.path.getsize(path)
   6:     if os.path.isdir(path):
   7:         for filename in os.listdir(path):
   8:             childpath = os.path.join(path, filename)
-  9:             total += disk_usage(childpath)
+  9:             total -= disk_usage(childpath)
  10:     
  11:     print('{0:<7}'.format(total), path)
  12:     return total
--------------------------------------------------------------------------------
0       C:\Users\kshit\AppData\Local\Temp\tmpb1dku2u0\empty_folder
15      C:\Users\kshit\AppData\Local\Temp\tmp30gmmiez\test_file.txt
15      C:\Users\kshit\AppData\Local\Temp\tmp0x8a_b1h\folder_with_files\file1.txt
15      C:\Users\kshit\AppData\Local\Temp\tmp0x8a_b1h\folder_with_files\file2.txt
15      C:\Users\kshit\AppData\Local\Temp\tmp0x8a_b1h\folder_with_files\subfolder\file3.txt
-15     C:\Users\kshit\AppData\Local\Temp\tmp0x8a_b1h\folder_with_files\subfolder
-15     C:\Users\kshit\AppData\Local\Temp\tmp0x8a_b1h\folder_with_files
[0.00970 s] killed by test_folder_with_files (test_disk_usage.TestDiskUsage)
