   - [#  10] ASR find_boyer_moore: 
--------------------------------------------------------------------------------
  33:         if T[i] == P[k]:
  34:             if k == 0:
  35:                 return i
  36:             else:
- 37:                 i -= 1
+ 37:                 i += 1
  38:                 k -= 1
  39:         else:
  40:             j = last.get(T[i], -1)
  41:             i += m - min(k, j + 1)
--------------------------------------------------------------------------------
[0.00400 s] killed by test_find_boyer_moore_basic (test_find_boyer_moore.TestFindBoyerMoore)

   - [#  11] ASR find_boyer_moore: 
--------------------------------------------------------------------------------
  34:             if k == 0:
  35:                 return i
  36:             else:
  37:                 i -= 1
- 38:                 k -= 1
+ 38:                 k += 1
  39:         else:
  40:             j = last.get(T[i], -1)
  41:             i += m - min(k, j + 1)
  42:             k = m - 1
--------------------------------------------------------------------------------
[0.00000 s] killed by test_find_boyer_moore_basic (test_find_boyer_moore.TestFindBoyerMoore)
