   - [#   1] COI disjoint: 
--------------------------------------------------------------------------------
   1: def disjoint1(A, B, C):
   2:     for a in A:
   3:         for b in B:
   4:             for c in C:
-  5:                 if a == b == c:
+  5:                 if not (a == b == c):
   6:                     return False
   7:     return True
   8: 
   9: def disjoint2(A, B, C):
--------------------------------------------------------------------------------
[0.01562 s] killed by test_common_element_disjoint_lists (test_disjoint.TestDisjointFunctions)

   - [#   2] COI disjoint: 
--------------------------------------------------------------------------------
   8: 
   9: def disjoint2(A, B, C):
  10:     for a in A:
  11:         for b in B:
- 12:             if a == b:
+ 12:             if not (a == b):
  13:                 for c in C:
  14:                     if a == c:
  15:                         return False
  16:     return True
--------------------------------------------------------------------------------
[0.00000 s] killed by test_single_element_lists (test_disjoint.TestDisjointFunctions)

   - [#   3] COI disjoint: 
--------------------------------------------------------------------------------
  10:     for a in A:
  11:         for b in B:
  12:             if a == b:
  13:                 for c in C:
- 14:                     if a == c:
+ 14:                     if not (a == c):
  15:                         return False
  16:     return True
--------------------------------------------------------------------------------
[0.00000 s] killed by test_common_element_disjoint_lists (test_disjoint.TestDisjointFunctions)

   - [#   4] ROR disjoint: 
--------------------------------------------------------------------------------
   1: def disjoint1(A, B, C):
   2:     for a in A:
   3:         for b in B:
   4:             for c in C:
-  5:                 if a == b == c:
+  5:                 if a != b == c:
   6:                     return False
   7:     return True
   8: 
   9: def disjoint2(A, B, C):
--------------------------------------------------------------------------------
[0.00000 s] killed by test_common_element_disjoint_lists (test_disjoint.TestDisjointFunctions)

   - [#   5] ROR disjoint: 
--------------------------------------------------------------------------------
   1: def disjoint1(A, B, C):
   2:     for a in A:
   3:         for b in B:
   4:             for c in C:
-  5:                 if a == b == c:
+  5:                 if a == b != c:
   6:                     return False
   7:     return True
   8: 
   9: def disjoint2(A, B, C):
--------------------------------------------------------------------------------
[0.01563 s] killed by test_common_element_disjoint_lists (test_disjoint.TestDisjointFunctions)

   - [#   6] ROR disjoint: 
--------------------------------------------------------------------------------
   8: 
   9: def disjoint2(A, B, C):
  10:     for a in A:
  11:         for b in B:
- 12:             if a == b:
+ 12:             if a != b:
  13:                 for c in C:
  14:                     if a == c:
  15:                         return False
  16:     return True
--------------------------------------------------------------------------------
[0.00000 s] killed by test_single_element_lists (test_disjoint.TestDisjointFunctions)

   - [#   7] ROR disjoint: 
--------------------------------------------------------------------------------
  10:     for a in A:
  11:         for b in B:
  12:             if a == b:
  13:                 for c in C:
- 14:                     if a == c:
+ 14:                     if a != c:
  15:                         return False
  16:     return True
--------------------------------------------------------------------------------
[0.00000 s] killed by test_common_element_disjoint_lists (test_disjoint.TestDisjointFunctions)
