   - [#   4] AOR binary_search: 
--------------------------------------------------------------------------------
   6:         mid = (low + high) // 2
   7:         if target == data[mid]:
   8:             return True
   9:         elif target < data[mid]:
- 10:             return binary_search(data, target, low, mid - 1)
+ 10:             return binary_search(data, target, low, mid + 1)
  11:         else:
  12:             return binary_search(data, target, mid + 1, high)
--------------------------------------------------------------------------------
[0.18435 s] killed by test_even_length_list_not_found (test_binary_search.TestBinarySearch)

   - [#   5] AOR binary_search: 
--------------------------------------------------------------------------------
   8:             return True
   9:         elif target < data[mid]:
  10:             return binary_search(data, target, low, mid - 1)
  11:         else:
- 12:             return binary_search(data, target, mid + 1, high)
+ 12:             return binary_search(data, target, mid - 1, high)
--------------------------------------------------------------------------------
[0.17556 s] killed by test_even_length_list_found (test_binary_search.TestBinarySearch)

   - [#   6] COI binary_search: 
--------------------------------------------------------------------------------
   1: def binary_search(data, target, low, high):
   2:     
-  3:     if low > high:
+  3:     if not (low > high):
   4:         return False
   5:     else:
   6:         mid = (low + high) // 2
   7:         if target == data[mid]:
--------------------------------------------------------------------------------
[0.00104 s] killed by test_empty_list (test_binary_search.TestBinarySearch)

   - [#   9] ROR binary_search: 
--------------------------------------------------------------------------------
   1: def binary_search(data, target, low, high):
   2:     
-  3:     if low > high:
+  3:     if low < high:
   4:         return False
   5:     else:
   6:         mid = (low + high) // 2
   7:         if target == data[mid]:
--------------------------------------------------------------------------------
[0.00000 s] killed by test_empty_list (test_binary_search.TestBinarySearch)

   - [#  10] ROR binary_search: 
--------------------------------------------------------------------------------
   1: def binary_search(data, target, low, high):
   2:     
-  3:     if low > high:
+  3:     if low >= high:
   4:         return False
   5:     else:
   6:         mid = (low + high) // 2
   7:         if target == data[mid]:
--------------------------------------------------------------------------------
[0.00060 s] killed by test_single_element_found (test_binary_search.TestBinarySearch)
