   - [#   6] COI binary_sum: 
--------------------------------------------------------------------------------
  1: def binary_sum(S, start, stop):
- 2:     if start >= stop:
+ 2:     if not (start >= stop):
  3:         return 0
  4:     elif start == stop - 1:
  5:         return S[start]
  6:     else:
--------------------------------------------------------------------------------
[0.18901 s] killed by test_empty_list (test_binary_sum.TestBinarySum)

   - [#   8] ROR binary_sum: 
--------------------------------------------------------------------------------
  1: def binary_sum(S, start, stop):
- 2:     if start >= stop:
+ 2:     if start <= stop:
  3:         return 0
  4:     elif start == stop - 1:
  5:         return S[start]
  6:     else:
--------------------------------------------------------------------------------
[0.00000 s] killed by test_large_input (test_binary_sum.TestBinarySum)

   - [#   9] ROR binary_sum: 
--------------------------------------------------------------------------------
  1: def binary_sum(S, start, stop):
- 2:     if start >= stop:
+ 2:     if start > stop:
  3:         return 0
  4:     elif start == stop - 1:
  5:         return S[start]
  6:     else:
--------------------------------------------------------------------------------
[0.16576 s] killed by test_empty_list (test_binary_sum.TestBinarySum)
