   - [#   1] ASR disk_usage: 
--------------------------------------------------------------------------------
   4:     total = os.path.getsize(path)
   5:     if os.path.isdir(path):
   6:         for filename in os.listdir(path):
   7:             childpath = os.path.join(path, filename)
-  8:             total += disk_usage(childpath)
+  8:             total -= disk_usage(childpath)
   9:     
  10:     print('{0:<7}'.format(total), path)
  11:     return total
--------------------------------------------------------------------------------
15      C:\Users\kshit\AppData\Local\Temp\tmpsvvyxgfb\test_dir\file1.txt
15      C:\Users\kshit\AppData\Local\Temp\tmpsvvyxgfb\test_dir\sub_dir\file2.txt
-15     C:\Users\kshit\AppData\Local\Temp\tmpsvvyxgfb\test_dir\sub_dir
0       C:\Users\kshit\AppData\Local\Temp\tmpsvvyxgfb\test_dir
[0.00352 s] killed by test_directory_with_files (test_disk_usage.TestDiskUsage)

   - [#   2] COI disk_usage: 
--------------------------------------------------------------------------------
   1: import os
   2: 
   3: def disk_usage(path):
   4:     total = os.path.getsize(path)
-  5:     if os.path.isdir(path):
+  5:     if not (os.path.isdir(path)):
   6:         for filename in os.listdir(path):
   7:             childpath = os.path.join(path, filename)
   8:             total += disk_usage(childpath)
   9:     
--------------------------------------------------------------------------------
0       C:\Users\kshit\AppData\Local\Temp\tmperz8v70f\test_dir
[0.00297 s] killed by test_directory_with_files (test_disk_usage.TestDiskUsage)
