   - [#   1] ASR disk_usage: 
--------------------------------------------------------------------------------
  26:     total = os.path.getsize(path)
  27:     if os.path.isdir(path):
  28:         for filename in os.listdir(path):
  29:             childpath = os.path.join(path, filename)
- 30:             total += disk_usage(childpath)
+ 30:             total -= disk_usage(childpath)
  31:     
  32:     print('{0:<7}'.format(total), path)
  33:     return total
--------------------------------------------------------------------------------
0       C:\Users\kshit\AppData\Local\Temp\tmpdrokni3t\empty_folder
15      C:\Users\kshit\AppData\Local\Temp\tmp_v7rshrj\test_file.txt
15      C:\Users\kshit\AppData\Local\Temp\tmpcibbs80b\folder_with_files\file1.txt
15      C:\Users\kshit\AppData\Local\Temp\tmpcibbs80b\folder_with_files\file2.txt
15      C:\Users\kshit\AppData\Local\Temp\tmpcibbs80b\folder_with_files\subfolder\file3.txt
-15     C:\Users\kshit\AppData\Local\Temp\tmpcibbs80b\folder_with_files\subfolder
-15     C:\Users\kshit\AppData\Local\Temp\tmpcibbs80b\folder_with_files
[0.00000 s] killed by test_folder_with_files (test_disk_usage.TestDiskUsage)
