   - [#  10] COI power_fast: 
--------------------------------------------------------------------------------
  1: def power(x, n):
- 2:     if n == 0:
+ 2:     if not (n == 0):
  3:         return 1
  4:     else:
  5:         partial = power(x, n // 2)
  6:         result = partial * partial
--------------------------------------------------------------------------------
[0.16845 s] killed by test_base_case (test_power_fast.TestPowerFunction)

   - [#  12] ROR power_fast: 
--------------------------------------------------------------------------------
  1: def power(x, n):
- 2:     if n == 0:
+ 2:     if n != 0:
  3:         return 1
  4:     else:
  5:         partial = power(x, n // 2)
  6:         result = partial * partial
--------------------------------------------------------------------------------
[0.17347 s] killed by test_base_case (test_power_fast.TestPowerFunction)
