   - [#   1] AOR reverse: 
--------------------------------------------------------------------------------
  20: 
  21: 
  22: def reverse(S, start, stop):
  23:     '''Reverse elements in implicit slice S[start:stop].'''
- 24:     if start < stop - 1:
+ 24:     if start < stop + 1:
  25:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
  26:         reverse(S, start + 1, stop - 1)
--------------------------------------------------------------------------------
[0.00460 s] killed by test_empty_slice (test_reverse.TestReverse)

   - [#   2] AOR reverse: 
--------------------------------------------------------------------------------
  21: 
  22: def reverse(S, start, stop):
  23:     '''Reverse elements in implicit slice S[start:stop].'''
  24:     if start < stop - 1:
- 25:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
+ 25:         (S[start], S[stop + 1]) = (S[stop - 1], S[start])
  26:         reverse(S, start + 1, stop - 1)
--------------------------------------------------------------------------------
[0.00000 s] killed by test_even_elements (test_reverse.TestReverse)

   - [#   3] AOR reverse: 
--------------------------------------------------------------------------------
  21: 
  22: def reverse(S, start, stop):
  23:     '''Reverse elements in implicit slice S[start:stop].'''
  24:     if start < stop - 1:
- 25:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
+ 25:         (S[start], S[stop - 1]) = (S[stop + 1], S[start])
  26:         reverse(S, start + 1, stop - 1)
--------------------------------------------------------------------------------
[0.00000 s] killed by test_even_elements (test_reverse.TestReverse)

   - [#   4] AOR reverse: 
--------------------------------------------------------------------------------
  22: def reverse(S, start, stop):
  23:     '''Reverse elements in implicit slice S[start:stop].'''
  24:     if start < stop - 1:
  25:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
- 26:         reverse(S, start + 1, stop - 1)
+ 26:         reverse(S, start - 1, stop - 1)
--------------------------------------------------------------------------------
[0.00973 s] killed by test_even_elements (test_reverse.TestReverse)

   - [#   5] AOR reverse: 
--------------------------------------------------------------------------------
  22: def reverse(S, start, stop):
  23:     '''Reverse elements in implicit slice S[start:stop].'''
  24:     if start < stop - 1:
  25:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
- 26:         reverse(S, start + 1, stop - 1)
+ 26:         reverse(S, start + 1, stop + 1)
--------------------------------------------------------------------------------
[0.00000 s] killed by test_even_elements (test_reverse.TestReverse)

   - [#   6] COI reverse: 
--------------------------------------------------------------------------------
  20: 
  21: 
  22: def reverse(S, start, stop):
  23:     '''Reverse elements in implicit slice S[start:stop].'''
- 24:     if start < stop - 1:
+ 24:     if not (start < stop - 1):
  25:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
  26:         reverse(S, start + 1, stop - 1)
--------------------------------------------------------------------------------
[0.00000 s] killed by test_empty_slice (test_reverse.TestReverse)

   - [#   7] ROR reverse: 
--------------------------------------------------------------------------------
  20: 
  21: 
  22: def reverse(S, start, stop):
  23:     '''Reverse elements in implicit slice S[start:stop].'''
- 24:     if start < stop - 1:
+ 24:     if start > stop - 1:
  25:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
  26:         reverse(S, start + 1, stop - 1)
--------------------------------------------------------------------------------
[0.00000 s] killed by test_empty_slice (test_reverse.TestReverse)

   - [#   8] ROR reverse: 
--------------------------------------------------------------------------------
  20: 
  21: 
  22: def reverse(S, start, stop):
  23:     '''Reverse elements in implicit slice S[start:stop].'''
- 24:     if start < stop - 1:
+ 24:     if start <= stop - 1:
  25:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
  26:         reverse(S, start + 1, stop - 1)
--------------------------------------------------------------------------------
[0.00000 s] survived
