   - [#   1] AOR reverse: 
--------------------------------------------------------------------------------
  1: def reverse(S, start, stop):
- 2:     if start < stop - 1:
+ 2:     if start < stop + 1:
  3:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
  4:         reverse(S, start + 1, stop - 1)
--------------------------------------------------------------------------------
[0.00200 s] killed by test_empty_list (test_reverse.TestReverseFunction)

   - [#   6] COI reverse: 
--------------------------------------------------------------------------------
  1: def reverse(S, start, stop):
- 2:     if start < stop - 1:
+ 2:     if not (start < stop - 1):
  3:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
  4:         reverse(S, start + 1, stop - 1)
--------------------------------------------------------------------------------
[0.00101 s] killed by test_empty_list (test_reverse.TestReverseFunction)

   - [#   7] ROR reverse: 
--------------------------------------------------------------------------------
  1: def reverse(S, start, stop):
- 2:     if start < stop - 1:
+ 2:     if start > stop - 1:
  3:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
  4:         reverse(S, start + 1, stop - 1)
--------------------------------------------------------------------------------
[0.00151 s] killed by test_empty_list (test_reverse.TestReverseFunction)

   - [#   8] ROR reverse: 
--------------------------------------------------------------------------------
  1: def reverse(S, start, stop):
- 2:     if start < stop - 1:
+ 2:     if start <= stop - 1:
  3:         (S[start], S[stop - 1]) = (S[stop - 1], S[start])
  4:         reverse(S, start + 1, stop - 1)
--------------------------------------------------------------------------------
[0.00100 s] survived
