   - [#   5] AOR merge_array: 
--------------------------------------------------------------------------------
  11: def merge_sort(S):
  12:     n = len(S)
  13:     if n < 2:
  14:         return
- 15:     mid = n // 2
+ 15:     mid = n * 2
  16:     S1 = S[0:mid]
  17:     S2 = S[mid:n]
  18:     merge_sort(S1)
  19:     merge_sort(S2)
--------------------------------------------------------------------------------
[0.16975 s] killed by test_duplicate_elements (test_merge_array.TestMergeSort)
