   - [#   1] AOR merge_nonrecur: 
--------------------------------------------------------------------------------
   1: import math
   2: 
   3: def merge(src, result, start, inc):
-  4:     end1 = start + inc
+  4:     end1 = start - inc
   5:     end2 = min(start + (2 * inc), len(src))
   6:     (x, y, z) = (start, start + inc, start)
   7:     while (x < end1 and y < end2):
   8:         if src[x] < src[y]:
--------------------------------------------------------------------------------
[0.00100 s] killed by test_duplicate_elements (test_merge_nonrecur.TestMergeSort)
