   - [#   1] AOD find_brute: 
--------------------------------------------------------------------------------
  5:         while (k < m and T[i + k] == P[k]):
  6:             k += 1
  7:         if k == m:
  8:             return i
- 9:     return -1
+ 9:     return 1
--------------------------------------------------------------------------------
[0.00095 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#   2] AOR find_brute: 
--------------------------------------------------------------------------------
  1: def find_brute(T, P):
  2:     (n, m) = (len(T), len(P))
- 3:     for i in range((n - m) + 1):
+ 3:     for i in range((n + m) + 1):
  4:         k = 0
  5:         while (k < m and T[i + k] == P[k]):
  6:             k += 1
  7:         if k == m:
--------------------------------------------------------------------------------
[0.00100 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#   3] AOR find_brute: 
--------------------------------------------------------------------------------
  1: def find_brute(T, P):
  2:     (n, m) = (len(T), len(P))
- 3:     for i in range((n - m) + 1):
+ 3:     for i in range((n - m) - 1):
  4:         k = 0
  5:         while (k < m and T[i + k] == P[k]):
  6:             k += 1
  7:         if k == m:
--------------------------------------------------------------------------------
[0.00100 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#   4] AOR find_brute: 
--------------------------------------------------------------------------------
  1: def find_brute(T, P):
  2:     (n, m) = (len(T), len(P))
  3:     for i in range((n - m) + 1):
  4:         k = 0
- 5:         while (k < m and T[i + k] == P[k]):
+ 5:         while (k < m and T[i - k] == P[k]):
  6:             k += 1
  7:         if k == m:
  8:             return i
  9:     return -1
--------------------------------------------------------------------------------
[0.00000 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#   5] AOR find_brute: 
--------------------------------------------------------------------------------
  5:         while (k < m and T[i + k] == P[k]):
  6:             k += 1
  7:         if k == m:
  8:             return i
- 9:     return -1
+ 9:     return +1
--------------------------------------------------------------------------------
[0.00000 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#   6] ASR find_brute: 
--------------------------------------------------------------------------------
  2:     (n, m) = (len(T), len(P))
  3:     for i in range((n - m) + 1):
  4:         k = 0
  5:         while (k < m and T[i + k] == P[k]):
- 6:             k += 1
+ 6:             k -= 1
  7:         if k == m:
  8:             return i
  9:     return -1
--------------------------------------------------------------------------------
[0.00000 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#   7] COI find_brute: 
--------------------------------------------------------------------------------
  1: def find_brute(T, P):
  2:     (n, m) = (len(T), len(P))
  3:     for i in range((n - m) + 1):
  4:         k = 0
- 5:         while (k < m and T[i + k] == P[k]):
+ 5:         while not ((k < m and T[i + k] == P[k])):
  6:             k += 1
  7:         if k == m:
  8:             return i
  9:     return -1
--------------------------------------------------------------------------------
[5.03930 s] timeout

   - [#   8] COI find_brute: 
--------------------------------------------------------------------------------
  3:     for i in range((n - m) + 1):
  4:         k = 0
  5:         while (k < m and T[i + k] == P[k]):
  6:             k += 1
- 7:         if k == m:
+ 7:         if not (k == m):
  8:             return i
  9:     return -1
--------------------------------------------------------------------------------
[0.00000 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#   9] LCR find_brute: 
--------------------------------------------------------------------------------
  1: def find_brute(T, P):
  2:     (n, m) = (len(T), len(P))
  3:     for i in range((n - m) + 1):
  4:         k = 0
- 5:         while (k < m and T[i + k] == P[k]):
+ 5:         while (k < m or T[i + k] == P[k]):
  6:             k += 1
  7:         if k == m:
  8:             return i
  9:     return -1
--------------------------------------------------------------------------------
[0.00097 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#  10] ROR find_brute: 
--------------------------------------------------------------------------------
  1: def find_brute(T, P):
  2:     (n, m) = (len(T), len(P))
  3:     for i in range((n - m) + 1):
  4:         k = 0
- 5:         while (k < m and T[i + k] == P[k]):
+ 5:         while (k > m and T[i + k] == P[k]):
  6:             k += 1
  7:         if k == m:
  8:             return i
  9:     return -1
--------------------------------------------------------------------------------
[0.00000 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#  11] ROR find_brute: 
--------------------------------------------------------------------------------
  1: def find_brute(T, P):
  2:     (n, m) = (len(T), len(P))
  3:     for i in range((n - m) + 1):
  4:         k = 0
- 5:         while (k < m and T[i + k] == P[k]):
+ 5:         while (k <= m and T[i + k] == P[k]):
  6:             k += 1
  7:         if k == m:
  8:             return i
  9:     return -1
--------------------------------------------------------------------------------
[0.00100 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#  12] ROR find_brute: 
--------------------------------------------------------------------------------
  1: def find_brute(T, P):
  2:     (n, m) = (len(T), len(P))
  3:     for i in range((n - m) + 1):
  4:         k = 0
- 5:         while (k < m and T[i + k] == P[k]):
+ 5:         while (k < m and T[i + k] != P[k]):
  6:             k += 1
  7:         if k == m:
  8:             return i
  9:     return -1
--------------------------------------------------------------------------------
[0.00000 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)

   - [#  13] ROR find_brute: 
--------------------------------------------------------------------------------
  3:     for i in range((n - m) + 1):
  4:         k = 0
  5:         while (k < m and T[i + k] == P[k]):
  6:             k += 1
- 7:         if k == m:
+ 7:         if k != m:
  8:             return i
  9:     return -1
--------------------------------------------------------------------------------
[0.00100 s] killed by test_case_sensitivity (test_find_brute.TestBruteForce)
